[
  {
    "video_id": "687caa1c61acc75954402704",
    "filename": "Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video captures a tense and dynamic scene from what appears to be a multiplayer survival game, set in a nocturnal urban environment. The protagonist, a female character, is seen sprinting through the town, clutching a pink weapon. The atmosphere is fraught with danger, as she navigates past buildings and trees, likely evading or pursuing other players.\nAs she approaches a tall building, she begins to ascend using wooden stairs that have been constructed against the structure. The climb is not without peril; another player, positioned above, launches a barrage of fire arrows, causing damage to the building and creating a sense of urgency. Upon reaching the top floor, the female character enters a room filled with scattered furniture, only to be met by another player who has jumped down from outside, adding to the intensity of the confrontation.\nInside the room, a fierce exchange of gunfire ensues between the two players. The combat is intense and strategic, with one player eventually breaking through a wall and escaping the room. This player continues to climb higher within the building, reaching the rooftop where two supply boxes are conveniently placed. Despite the presence of these boxes, the player does not take any items from them, perhaps prioritizing speed or strategy over immediate resource acquisition.\nThe video concludes with the player picking up a rocket launcher from the ground near the edge of the roof, setting the stage for a potential showdown or escape. The dialogue snippets, such as \"There's people here. Jesus Christ\" and \"They escaped Right,\" underscore the urgency and the multiplayer aspect of the game, suggesting that the player is aware of the presence of others and the need to adapt quickly to changing circumstances.\nOverall, the video provides a vivid and immersive glimpse into the fast-paced, strategic gameplay of a survival game, highlighting the importance of quick thinking, resource management, and combat skills in a dynamic and competitive environment.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Climb",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs while another player shoots fire arrows, causing damage to the structure.",
        "start": 0.0,
        "end": 19.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Battle",
        "chapter_summary": "Upon reaching the top floor, the female character enters a room with scattered furniture. Another player jumps into the room and they start shooting each other. One player breaks part of the wall and exits the room.",
        "start": 19.0,
        "end": 34.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Arrival",
        "chapter_summary": "The player who exited the room continues moving up the staircase until they reach the rooftop. Two supply boxes appear next to the player, but they do not take anything out.",
        "start": 34.0,
        "end": 56.0
      },
      {
        "chapter_number": 3,
        "chapter_title": "Rocket Launcher Pickup",
        "chapter_summary": "The player picks up a rocket launcher from the ground near the edge of the roof.",
        "start": 56.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots",
        "Effective building during combat",
        "Good use of mobility to reposition",
        "Resourceful in finding loot",
        "Strategic use of high ground"
      ],
      "bad": [
        "Some missed shots that could have been avoided",
        "Occasional poor positioning in the storm",
        "Wasted resources on unnecessary builds",
        "Lack of awareness of enemy positions",
        "Slow decision-making in some situations"
      ],
      "improve": [
        "Practice quick edits under pressure",
        "Prioritize high ground in late-game",
        "Enhance situational awareness",
        "Improve decision-making speed",
        "Focus on minimizing wasted resources"
      ]
    },
    "thumbnail_url": "http://localhost:5173/placeholder.png"
  },
  {
    "video_id": "687cb313934487793c5677b6",
    "filename": "Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video captures an intense scene of a night-time battle in a town, featuring two players engaged in a high-stakes combat scenario. The action begins with a female character sprinting through the town, her pink weapon in hand, as she navigates past buildings and trees. Her movements are swift and purposeful, suggesting a sense of urgency. The camera follows her closely as she heads towards a tall building and starts climbing it using wooden stairs that have been erected against the side of the structure.\nAs she ascends, the tension escalates. Another player, positioned above, begins to shoot fire arrows, causing significant damage to the building's structure. This adds a layer of danger to the climb, as the wooden stairs and the building itself become increasingly unstable. Upon reaching the top floor, the female character enters a room filled with scattered furniture, only to be met by another player who jumps down from outside, initiating a fierce exchange of gunfire.\nThe dialogue, \"There's people here. Jesus Christ,\" underscores the unexpected presence of combatants, adding a sense of shock and surprise to the scene. The combatants engage in a rapid-fire exchange, and one of them manages to break through a part of the wall, escaping the room. The escaping player continues to move up the staircase within the building, eventually reaching the rooftop.\nOn the roof, the player demonstrates resourcefulness by picking up items such as bandages and ammunition, preparing for further combat. The dialogue, \"They escaped. Right,\" indicates a strategic assessment of the situation. The player then makes a daring leap off the edge of the building, landing on lower rooftops below. The final moments of the video show the player engaging in combat again, eliminating two opponents who were also present on those rooftops. The brief dialogue, \"Flash,\" suggests a quick and decisive action.\nOverall, the video presents a dynamic and action-packed sequence of events, highlighting the skills and strategies of the players in a night-time urban combat scenario. The creator of the video likely aimed to showcase the intensity and unpredictability of the game, emphasizing the importance of quick thinking and adaptability in high-pressure situations.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Entry",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs and enters a room filled with scattered furniture. Another player jumps into the room from outside.",
        "start": 0.0,
        "end": 25.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Combat and Escape",
        "chapter_summary": "Both players engage in combat inside the room, exchanging shots. One player breaks part of the wall and exits the room, continuing to move up the staircase within the same building until reaching the rooftop.",
        "start": 26.0,
        "end": 48.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Actions and Final Combat",
        "chapter_summary": "On the rooftop, the player picks up items like bandages and ammunition before jumping to lower rooftops. The player engages in combat again, eliminating two opponents on those rooftops.",
        "start": 49.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots",
        "Effective building during combat",
        "Good use of mobility to reposition",
        "Resourceful in finding loot",
        "Strategic use of high ground"
      ],
      "bad": [
        "Some missed shots that could have been avoided",
        "Occasional poor positioning in the storm",
        "Wasted resources on unnecessary builds",
        "Lack of awareness of enemy positions",
        "Slow decision-making in some situations"
      ],
      "improve": [
        "Practice quick edits under pressure",
        "Prioritize high ground in late-game",
        "Enhance situational awareness",
        "Improve decision-making speed",
        "Focus on minimizing wasted resources"
      ]
    },
    "thumbnail_url": "http://localhost:5173/placeholder.png"
  },
  {
    "video_id": "687cb4c04e10ac0ab354b584",
    "filename": "Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video opens with a female character sprinting through a nocturnal town, her pink weapon gripped tightly in her hand. She navigates past buildings and trees, her movements swift and purposeful. The camera follows her as she heads toward a tall building, where she begins to ascend using wooden stairs that have been constructed against its side. As she climbs higher, another player, positioned above, starts shooting fire arrows, causing damage to the surrounding structure. Upon reaching the top floor, she enters a room filled with scattered furniture.\nInside the room, another player makes an entrance by jumping down from outside. The two players immediately engage in a fierce shootout, exchanging shots rapidly. During the confrontation, one player manages to break part of the wall and escapes the room. The escaping player continues to move up the staircase within the building until they reach the rooftop. On the rooftop, two supply boxes appear next to the player. They open these boxes but do not take anything out. The dialogue suggests a moment of realization or perhaps a strategic decision, as the player picks up a rocket launcher from the ground near the edge of the roof.\nThroughout the video, the tension is palpable, with the dialogue providing additional context to the action. The player's exclamation, \"There's people here. Jesus Christ,\" underscores the unexpected encounter, while the comment, \"They escaped Right,\" indicates a strategic acknowledgment of the opponent's actions. The final word, \"Flash,\" might hint at a tactical move or a signal to teammates, though the exact context is not clear from the provided information. The video captures a dynamic and intense sequence of events in what appears to be a multiplayer game, focusing on the player's journey from the ground to the rooftop, and their interactions with another player along the way.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Climb",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs while another player shoots fire arrows, causing damage to the structure.",
        "start": 0.0,
        "end": 19.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Battle",
        "chapter_summary": "Upon reaching the top floor, the female character enters a room with scattered furniture. Another player jumps into the room and they start shooting each other. One player breaks part of the wall and exits the room.",
        "start": 19.0,
        "end": 34.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Arrival",
        "chapter_summary": "The player who exited the room continues moving up the staircase until they reach the rooftop. Two supply boxes appear next to the player, but they do not take anything out.",
        "start": 34.0,
        "end": 56.0
      },
      {
        "chapter_number": 3,
        "chapter_title": "Rocket Launcher Pickup",
        "chapter_summary": "The player picks up a rocket launcher from the ground near the edge of the roof.",
        "start": 56.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots",
        "Effective building during combat",
        "Good use of mobility to reposition",
        "Resourceful in finding loot",
        "Strategic use of high ground"
      ],
      "bad": [
        "Some missed shots that could have been avoided",
        "Occasional poor positioning in the storm",
        "Wasted resources on unnecessary builds",
        "Lack of awareness of enemy positions",
        "Slow decision-making in some situations"
      ],
      "improve": [
        "Practice quick edits under pressure",
        "Prioritize high ground in late-game",
        "Enhance situational awareness",
        "Improve decision-making speed",
        "Focus on minimizing wasted resources"
      ]
    },
    "thumbnail_url": "http://localhost:5173/placeholder.png"
  },
  {
    "video_id": "687cb6db61fa6d2e4d154755",
    "filename": "Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video opens with a female character sprinting through a town at night, her movements swift and purposeful as she holds a pink weapon tightly. The camera follows her closely, capturing the details of the buildings and trees she passes by. Her destination is a tall building, and she begins to ascend it using wooden stairs that have been constructed against its side. As she climbs higher, the tension in the scene escalates with the appearance of another player shooting fire arrows from above, causing damage to the structure around them. This adds a layer of danger and urgency to her ascent.\nUpon reaching the top floor, she enters a room filled with scattered furniture, only to find another player who has jumped down from outside. The two players immediately engage in a shootout, exchanging shots within the confined space. The combat is intense, with one player eventually breaking part of the wall and exiting the room, continuing their climb up the staircase within the building. The dialogue captures the surprise and tension, with phrases like \"There's people here. Jesus Christ\" and \"They escaped Right\" reflecting the player's reactions to the unexpected encounter and subsequent escape.\nThe player who broke through the wall reaches the rooftop, where two supply boxes appear next to them. They open these boxes but do not take anything out, perhaps indicating a rush or a strategic decision to leave them for later. The video concludes with the player picking up a rocket launcher from the ground near the edge of the roof, setting the stage for a potential new phase of the conflict. The final dialogue, \"Flash,\" might hint at a tactical move or a signal to teammates, adding a layer of complexity to the player's actions and intentions.\nOverall, the video showcases a dynamic and intense sequence of events in what appears to be a multiplayer game, focusing on the strategic movements, combat, and resource management of the players. The creator of the video likely aims to highlight the fast-paced and unpredictable nature of the gameplay, as well as the skill and decision-making of the players involved.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Climb",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs while another player shoots fire arrows, causing damage to the structure.",
        "start": 0.0,
        "end": 19.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Battle",
        "chapter_summary": "Upon reaching the top floor, the female character enters a room with scattered furniture. Another player jumps into the room and they start shooting each other. One player breaks part of the wall and exits the room.",
        "start": 19.0,
        "end": 34.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Arrival",
        "chapter_summary": "The player who exited the room continues moving up the staircase until they reach the rooftop. Two supply boxes appear next to the player, but they do not take anything out.",
        "start": 34.0,
        "end": 56.0
      },
      {
        "chapter_number": 3,
        "chapter_title": "Rocket Launcher Pickup",
        "chapter_summary": "The player picks up a rocket launcher from the ground near the edge of the roof.",
        "start": 56.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots",
        "Effective building during combat",
        "Good use of mobility to reposition",
        "Resourceful in finding loot",
        "Strategic use of high ground"
      ],
      "bad": [
        "Some missed shots that could have been avoided",
        "Occasional poor positioning in the storm",
        "Wasted resources on unnecessary builds",
        "Lack of awareness of enemy positions",
        "Slow decision-making in some situations"
      ],
      "improve": [
        "Practice quick edits under pressure",
        "Prioritize high ground in late-game",
        "Enhance situational awareness",
        "Improve decision-making speed",
        "Focus on minimizing wasted resources"
      ]
    },
    "thumbnail_url": "http://localhost:5173/placeholder.png"
  },
  {
    "video_id": "687cb9962b144dc12e031e52",
    "filename": "Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "video_path": "uploads\\Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video captures a tense and dynamic scene from what appears to be a multiplayer video game, set in a nocturnal town environment. The protagonist, a female character, is seen sprinting through the streets, clutching a pink weapon. Her movements are swift and purposeful, as she navigates past buildings and trees, indicating a sense of urgency and possibly a chase scenario.\nAs she approaches a tall building, she begins to ascend using wooden stairs that have been constructed against the side of the structure. The climb is interrupted by another player who is positioned higher up, shooting fire arrows that damage the surrounding environment. This adds a layer of danger and complexity to the protagonist's ascent. Upon reaching the top floor, she enters a room filled with scattered furniture, only to find another player who has jumped down from outside, ready for confrontation.\nInside the room, the two players engage in a fierce exchange of gunfire. The intensity of the battle is palpable, and the dialogue captures the shock and surprise of the situation, with phrases like \"There's people here. Jesus Christ.\" and \"They escaped Right.\" The combat is intense, leading to one player breaking part of the wall and exiting the room, continuing their climb up the staircase within the building. The chase continues as the player reaches the rooftop, where they encounter two supply boxes. Despite the presence of these boxes, the player does not take anything from them, instead opting to pick up a rocket launcher from the ground near the edge of the roof.\nThe video effectively conveys the adrenaline and excitement of a multiplayer game, showcasing the interaction between players, the use of various weapons, and the dynamic environment. The rooftop scene, with its supply boxes and the final weapon pickup, suggests a transition to a new phase of the game, possibly leading to a more explosive confrontation. Overall, the video provides a vivid glimpse into the fast-paced and competitive nature of the game, highlighting the strategic and reactive skills required to succeed in such an environment.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Climb",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs while another player shoots fire arrows, causing damage to the structure.",
        "start": 0.0,
        "end": 19.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Battle",
        "chapter_summary": "Upon reaching the top floor, the female character enters a room with scattered furniture. Another player jumps into the room and they start shooting each other. One player breaks part of the wall and exits the room.",
        "start": 19.0,
        "end": 34.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Arrival",
        "chapter_summary": "The player who exited the room continues moving up the staircase until they reach the rooftop. Two supply boxes appear next to the player, but they do not take anything out.",
        "start": 34.0,
        "end": 56.0
      },
      {
        "chapter_number": 3,
        "chapter_title": "Rocket Launcher Pickup",
        "chapter_summary": "The player picks up a rocket launcher from the ground near the edge of the roof.",
        "start": 56.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots",
        "Effective building during combat",
        "Good use of mobility to reposition",
        "Resourceful in finding loot",
        "Strategic use of high ground"
      ],
      "bad": [
        "Some missed shots that could have been avoided",
        "Occasional poor positioning in the storm",
        "Wasted resources on unnecessary builds",
        "Lack of awareness of enemy positions",
        "Slow decision-making in some situations"
      ],
      "improve": [
        "Practice quick edits under pressure",
        "Prioritize high ground in late-game",
        "Enhance situational awareness",
        "Improve decision-making speed",
        "Focus on minimizing wasted resources"
      ]
    },
    "thumbnail_url": "http://localhost:5173/placeholder.png"
  },
  {
    "video_id": "687cc03d2b144dc12e031ea4",
    "filename": "Fortnite%202025.07.17%20-%2005.09.14.06.DVR.mp4",
    "video_path": "uploads/Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video captures an intense scene from what appears to be a multiplayer survival game, set in a nocturnal town environment. The protagonist, a female character, is seen sprinting through the town, clutching a pink weapon. She navigates past various buildings and trees, her movements suggesting urgency and a sense of being pursued or seeking to pursue others.\nAs she approaches a tall building, she begins to ascend using wooden stairs that have been constructed against its side. The climb is not without peril, as another player, positioned above, fires fire arrows, causing damage to the structure around her. Despite the danger, she continues her ascent and eventually reaches the top floor, where she enters a room filled with scattered furniture.\nInside the room, a confrontation ensues as another player jumps down from outside, and both characters engage in a shootout. The dialogue captures the tension, with one player exclaiming, \"There's people here. Jesus Christ.\" The exchange of shots is fierce, and one player manages to break part of the wall, using it as an escape route. The escaping player continues to move up the staircase within the building, reaching the rooftop.\nOn the rooftop, the player encounters two supply boxes, which they open but do not take anything from. The dialogue here indicates a moment of realization or perhaps a missed opportunity, with the player saying, \"They escaped.\" Finally, the player picks up a rocket launcher from the ground near the edge of the roof, the weapon's presence suggesting a potential for a more powerful confrontation or a strategic move to defend their position.\nThe video effectively portrays the dynamic and competitive nature of the game, highlighting the importance of quick reflexes, strategic thinking, and resource management in a high-stakes environment. The use of dialogue adds a layer of realism and emotional depth to the action, making the viewer feel more connected to the characters and their experiences.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Climb",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs while another player shoots fire arrows, causing damage to the structure.",
        "start": 0.0,
        "end": 19.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Battle",
        "chapter_summary": "Upon reaching the top floor, the female character enters a room with scattered furniture. Another player jumps into the room and they start shooting each other. One player breaks part of the wall and exits the room.",
        "start": 19.0,
        "end": 34.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Arrival",
        "chapter_summary": "The player who exited the room continues moving up the staircase until they reach the rooftop. Two supply boxes appear next to the player, but they do not take anything out.",
        "start": 34.0,
        "end": 56.0
      },
      {
        "chapter_number": 3,
        "chapter_title": "Rocket Launcher Pickup",
        "chapter_summary": "The player picks up a rocket launcher from the ground near the edge of the roof.",
        "start": 56.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots at 16s",
        "Effective building during combat at 19s",
        "Good positioning on high ground at 48s"
      ],
      "bad": [
        "Missed shots during exchange at 13s",
        "Poor positioning in storm at 48s"
      ],
      "improve": [
        "Practice quicker building at 19s to minimize exposure",
        "Improve situational awareness at 13s to avoid ambushes"
      ]
    },
    "thumbnail_url": "http://localhost:5000/uploads/thumbnail_687cc03d2b144dc12e031ea4.png"
  },
  {
    "video_id": "687cc9722b144dc12e031f51",
    "filename": "Fortnite%202025.07.17%20-%2005.09.14.06.DVR.mp4",
    "video_path": "uploads/Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video opens with a female character sprinting through a nocturnal town, clutching a pink weapon. She navigates past various buildings and trees, her movements suggesting urgency and determination. The camera follows her closely as she heads towards a tall building and starts to ascend using wooden stairs that have been constructed against the building's side. As she climbs higher, another player appears, shooting fire arrows from above, causing damage to the structure around them. This action adds a layer of tension and danger to the scene.\nUpon reaching the top floor, the female character enters a room filled with scattered furniture. Another player then jumps into the room from outside, initiating a confrontation. Both players engage in a shoot-out, exchanging fire within the confined space. During the exchange, one of the players manages to break part of the wall and exits the room, continuing their ascent up the staircase within the building. The dialogue at this point, \"They escaped Right,\" confirms the player's successful evasion.\nThe player who escaped reaches the rooftop, where two supply boxes are conveniently placed next to them. They open these boxes but choose not to take anything from them, possibly indicating a rush or a strategic decision to conserve time. The video concludes with the player picking up a rocket launcher from the ground near the edge of the roof, setting the stage for a potential final showdown or escape.\nThroughout the video, the dialogue provides additional context, such as the initial exclamation of \"There's people here. Jesus Christ,\" which suggests surprise and perhaps fear at the unexpected presence of other players. The overall tone of the video is intense and action-packed, likely intended to showcase the dynamic gameplay and survival elements of a multiplayer game, possibly a battle royale or survival scenario.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Climb",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs while another player shoots fire arrows, causing damage to the structure.",
        "start": 0.0,
        "end": 19.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Battle",
        "chapter_summary": "Upon reaching the top floor, the female character enters a room with scattered furniture. Another player jumps into the room and they start shooting each other. One player breaks part of the wall and exits the room.",
        "start": 19.0,
        "end": 34.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Arrival",
        "chapter_summary": "The player who exited the room continues moving up the staircase until they reach the rooftop. Two supply boxes appear next to the player, but they do not take anything out.",
        "start": 34.0,
        "end": 56.0
      },
      {
        "chapter_number": 3,
        "chapter_title": "Rocket Launcher Pickup",
        "chapter_summary": "The player picks up a rocket launcher from the ground near the edge of the roof.",
        "start": 56.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots at 16s",
        "Effective building during combat at 19s",
        "Good positioning on high ground at 48s"
      ],
      "bad": [
        "Missed shots during exchange at 13s",
        "Poor positioning in storm at 45s"
      ],
      "improve": [
        "Practice quicker building at 19s to minimize exposure",
        "Improve situational awareness at 45s to avoid ambushes"
      ]
    },
    "thumbnail_url": "http://localhost:5000/uploads/thumbnail_687cc9722b144dc12e031f51.png"
  },
  {
    "video_id": "687ccdf64e10ac0ab354b6df",
    "filename": "Fortnite%202025.07.17%20-%2005.09.14.06.DVR.mp4",
    "video_path": "uploads/Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video captures an intense scene from what appears to be a multiplayer survival game, set in a nocturnal town environment. The action centers around a female character who is seen sprinting through the town, clutching a pink weapon. As she navigates through the area, she passes by various buildings and trees, indicating a mix of urban and natural settings. The tension escalates as she approaches a tall building, where she begins to ascend using wooden stairs that have been constructed against the side of the structure.\nMidway through her climb, the video reveals another player shooting fire arrows from above, causing significant damage to the surrounding environment. This adds a layer of danger and urgency to her ascent. Upon reaching the top floor, she enters a room filled with scattered furniture, only to find another player who has jumped down from outside. The two players immediately engage in a firefight, exchanging shots within the confined space. The combat is fierce, and one of the players manages to break through a wall and exit the room, continuing their ascent within the building.\nThe player who broke through the wall reaches the rooftop, where two supply boxes are conveniently placed next to them. Despite the availability of supplies, the player chooses not to take anything from the boxes, instead opting to pick up a rocket launcher from the ground near the edge of the roof. The dialogue in the video provides additional context, with phrases like \"There's people here. Jesus Christ\" and \"They escaped Right,\" indicating the player's awareness of other participants in the game and the ongoing struggle for survival.\nThe overall tone of the video is fast-paced and action-packed, with a strong emphasis on combat and strategic movement. The creator of the video likely aimed to showcase the dynamic gameplay and the high-stakes environment of the game, highlighting the importance of quick thinking and resourcefulness in a survival scenario.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Climb",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs while another player shoots fire arrows, causing damage to the structure.",
        "start": 0.0,
        "end": 19.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Battle",
        "chapter_summary": "Upon reaching the top floor, the female character enters a room with scattered furniture. Another player jumps into the room and they start shooting each other. One player breaks part of the wall and exits the room.",
        "start": 19.0,
        "end": 34.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Arrival",
        "chapter_summary": "The player who exited the room continues moving up the staircase until they reach the rooftop. Two supply boxes appear next to the player, but they do not take anything out.",
        "start": 34.0,
        "end": 56.0
      },
      {
        "chapter_number": 3,
        "chapter_title": "Rocket Launcher Pickup",
        "chapter_summary": "The player picks up a rocket launcher from the ground near the edge of the roof.",
        "start": 56.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots at 16s (00:16)",
        "Effective use of building structures for climbing at 12s (00:12)",
        "Good positioning on high ground at 48s (00:48)"
      ],
      "bad": [
        "Missed shots during exchange at 13s (00:13)",
        "Failed to take advantage of resources on the rooftop at 56s (00:56)"
      ],
      "improve": [
        "Practice quicker building techniques at 19s (00:19) to minimize exposure to enemy fire",
        "Improve situational awareness at 13s (00:13) to avoid getting caught in damaging fire arrows",
        "Consider taking supplies from boxes at 56s (00:56) to better manage resources"
      ]
    },
    "thumbnail_url": "http://localhost:5000/uploads/thumbnail_687ccdf64e10ac0ab354b6df.png"
  },
  {
    "video_id": "687cefcf61acc75954402a4b",
    "filename": "Fortnite%202025.07.17%20-%2005.09.14.06.DVR.mp4",
    "video_path": "uploads/Fortnite 2025.07.17 - 05.09.14.06.DVR.mp4",
    "summary": "The video captures a tense and dynamic scene from what appears to be a multiplayer online battle game, set in a nocturnal urban environment. A female character, equipped with a pink weapon, sprints through the town, dodging potential threats and navigating around buildings and trees. The camera closely follows her as she makes her way towards a tall building, ascending it via a makeshift wooden staircase.\nAs she climbs higher, the tension escalates with another player firing fire arrows from an upper vantage point, causing collateral damage to the structure. Upon reaching the rooftop of the building, she enters a room filled with scattered furniture. Moments later, another player jumps into the room from outside, initiating a direct confrontation. Both players engage in a fierce exchange of gunfire, and in the chaos, one of them manages to break through a wall and escape the room.\nThe escaping player continues their ascent within the building, eventually reaching the rooftop. Here, they encounter two supply boxes, which they open but do not loot. The dialogue suggests a sense of urgency and surprise, with phrases like \"There's people here. Jesus Christ\" and \"They escaped Right\" indicating the fast-paced and unpredictable nature of the game. The video concludes with the player picking up a rocket launcher from the ground near the edge of the roof, setting the stage for a potential new phase of the battle.\nThe video's creator likely aimed to showcase the intense gameplay, strategic movement, and the variety of weapons and interactions available in the game. The night setting and the use of fire arrows and a rocket launcher add to the dramatic and action-packed atmosphere, highlighting the game's immersive and competitive elements.",
    "chapters": [
      {
        "chapter_number": 0,
        "chapter_title": "Nighttime Chase and Climb",
        "chapter_summary": "A female character runs through a town at night, holding a pink weapon. She climbs a tall building using wooden stairs while another player shoots fire arrows, causing damage to the structure.",
        "start": 0.0,
        "end": 19.0
      },
      {
        "chapter_number": 1,
        "chapter_title": "Room Battle",
        "chapter_summary": "Upon reaching the top floor, the female character enters a room with scattered furniture. Another player jumps into the room and they start shooting each other. One player breaks part of the wall and exits the room.",
        "start": 19.0,
        "end": 34.0
      },
      {
        "chapter_number": 2,
        "chapter_title": "Rooftop Arrival",
        "chapter_summary": "The player who exited the room continues moving up the staircase until they reach the rooftop. Two supply boxes appear next to the player, but they do not take anything out.",
        "start": 34.0,
        "end": 56.0
      },
      {
        "chapter_number": 3,
        "chapter_title": "Rocket Launcher Pickup",
        "chapter_summary": "The player picks up a rocket launcher from the ground near the edge of the roof.",
        "start": 56.0,
        "end": 60.0
      }
    ],
    "advice": {
      "good": [
        "Accurate aim on headshots at 16s",
        "Effective building during combat at 21s",
        "Good positioning on high ground at 48s"
      ],
      "bad": [
        "Missed shots during exchange at 13s",
        "Poor positioning in storm at 57s"
      ],
      "improve": [
        "Practice quicker building at 21s to minimize exposure",
        "Improve situational awareness at 13s to avoid ambushes"
      ]
    },
    "thumbnail_url": "http://localhost:5000/uploads/thumbnail_687cefcf61acc75954402a4b.png"
  }
]